[
    {
        "title": [
            "Our most-broken and least-understood rules is \"helpers may",
            "not invite private contact as a first resort\", so we've made",
            "a new wiki to explain it"
        ],
        "text": [
            "We understand that most people who reply immediately to an",
            "OP with an invitation to talk privately  mean only to help,",
            "but this type of response usually leads to either",
            "disappointment or disaster.  it usually works out quite",
            "differently here than when you say \"PM me anytime\" in a",
            "casual social context.    We have huge admiration and",
            "appreciation for the goodwill and good citizenship of so",
            "many of you who support others here and flag inappropriate",
            "content - even more so because we know that so many of you",
            "are struggling yourselves.  We're hard at work behind the",
            "scenes on more information and resources to make it easier",
            "to give and get quality help here - this is just a small",
            "start.    Our new wiki page explains in detail why it's much",
            "better to respond in public comments, at least until you've",
            "gotten to know someone.  It will be maintained at",
            "/r/depression/wiki/private_contact, and the full text of the",
            "current version is below.  *****  ###Summary###  **Anyone",
            "who, while acting as a helper, invites or accepts private",
            "contact (I.e. PMs, chat, or any kind of offsite",
            "communication) early in the conversion is showing either bad",
            "intentions or bad judgement.  Either way, it's unwise to",
            "trust them.**    \"PM me anytime\" seems like a kind and",
            "generous offer. And it might be perfectly well-meaning, but,",
            "unless and until a solid rapport has been established, it's",
            "just not a wise idea.  Here are some points to consider",
            "before you offer or accept an invitation to communicate",
            "privately.  * **By posting supportive replies publicly,",
            "you'll help more people than just the OP. If your responses",
            "are of good quality, you'll educate and inspire other",
            "helpers.** [The 1-9-90",
            "rule](https://en.wikipedia.org/wiki/1%25_rule_(Internet_culture\\))",
            "applies here as much as it does anywhere else on the",
            "internet.    * People who are struggling with serious",
            "mental-health issues often (justifiably) have a low",
            "tolerance for disappointment and a high-level of ever-",
            "changing emotional need. **Unless the helper is able to make",
            "a 100% commitment to be there for them in every way, for as",
            "long as necessary, offering a personal inbox as a resource",
            "is likely to do more harm than good.** This is why mental-",
            "health crisis-line responders usually don't give their names",
            "and callers aren't allowed to request specific responders.",
            "It's much healthier and safer for the callers to develop a",
            "relationship with the agency as a whole.  Analogously, it's",
            "much safer and healthier for our OPs to develop a",
            "relationship with the community as a whole.  Even trained",
            "responders are generally not allowed to work high-intensity",
            "situations alone.  It's partly about availability, but it's",
            "mostly about wider perspective and preventing compassion",
            "fatigue.   * **If a helper gets in over their head with",
            "someone whose mental-health issues (including suicidality,",
            "which is often comorbid with depression) escalate, in a PM",
            "conversation it's much harder for others, including the",
            "/r/depression and /r/SuicideWatch moderators to help**.",
            "(Contrary to common assumptions, moderators can't see or",
            "police PMs.)    * In our observation over many years, the",
            "people who say \"PM me\" the most are consistently the ones",
            "with the least understanding of mental-health issues and",
            "mental-health support. We all have gaps in our knowledge and",
            "in our ability to communicate effectively.  Community input",
            "mitigates these limitations. **There's no reason why someone",
            "who's truly here to help would want to hide their responses",
            "from community scrutiny**.  If helpers are concerned about",
            "their own privacy, keep in mind that self-disclosure, when",
            "used supportively, is more about the feelings than the",
            "details, and that we have no problem here with the use of",
            "alt/throwaway accounts, and have no restrictions on account",
            "age or karma.    *  We all know the internet is used by some",
            "people to exploit or abuse others.  These people *do* want",
            "to hide their deceptive and manipulative responses from",
            "everyone except their victims. There are many of them who",
            "specifically target those who are vulnerable because of",
            "mental-health issues. **If a helper invites an OP to talk",
            "privately and gives them a good, supportive experience,",
            "they've primed that person to be more vulnerable to",
            "abusers.** This sort of cognitive priming tends to be",
            "particularly effective when someone's in a state of mental-",
            "health crisis, when people rely more on heuristics than",
            "critical reasoning.  * If OPs want to talk privately,",
            "posting on a wide-open anonymous forum like reddit might not",
            "be the best option. Although we don't recommend it, we do",
            "allow OPs to request private contact when asking for",
            "support. If you want to do this, please keep your",
            "expectations realistic, and to have a careful look at the",
            "history of anyone who offers to PM before opening up to",
            "them."
        ]
    },
    {
        "title": [
            "Regular check-in post, with essential information about our",
            "rules and resources"
        ],
        "text": [
            "Welcome to /r/depression's check-in post - a place to take a",
            "moment and share what is going on and how you are doing. If",
            "you're having a tough time but prefer not to make your own",
            "post, or have an accomplishment you want to talk about",
            "(these aren't allowed standalone posts in the sub as they",
            "violate the \"role model\" rule),  this is a place you can",
            "share.  -----  Our subreddit rules are very different from",
            "most of the rest of reddit!  Since all of them exist for",
            "important reasons, we ask everyone here to read and follow",
            "them. Please click 'report' on any harmful content you see",
            "here - we always want to know and deal as soon as we can.",
            "We also have several resource wikis for help with finding",
            "and giving support:",
            "https://www.reddit.com/r/depression/wiki/what_is_depression",
            "provides guidance about what is and isn't a depressive",
            "disorder, guidance on the complex nature of the illnesses",
            "that are usually grouped under the \"depression\" label, and",
            "redirect information for common off-topic issues.",
            "https://www.reddit.com/r/depression/wiki/giving_help offers",
            "information on the nature and value of peer support for",
            "mental-health issues in general, and lots of guidance for",
            "learning what is -- and isn't -- usually helpful in giving",
            "peer support.  YSK that the types of rule violations that we",
            "most frequently see here are:  - People breaking the private",
            "contact rule. You should never trust anyone who tries to get",
            "you into a private conversation in response to a post here.",
            "See https://www.reddit.com/r/depression/wiki/private_contact",
            "- \"I'm here to help\" posts. This shows that you don't",
            "understand the most basic principles of peer support,",
            "especially selectivity. The \"giving help\" wiki explains more",
            "about this.  - Role modelling, i.e. \"achievement\" or",
            "\"advice\" posts. This is an expert-free zone -- that's what",
            "peer support means (rule 5). We know that \"internet culture\"",
            "celebrate not just bragging about your achievements but",
            "bragging about your good intentions. Nothing like that is",
            "ever acceptable here.  - Content that's more about 'making a",
            "statement' or casually polling the sub than seeking personal",
            "support  (rules 1, 2 and 10).  - Off-topic posts about",
            "difficult situations or circumstances, including",
            "interpersonal issues. Grief, sadness, anger, loneliness and",
            "other difficult emotions are not mental illnesses. The \"what",
            "is depression\" wiki has suggestions for other places to post",
            "about these issues, which are 100% valid and serious but",
            "inappropriate here."
        ]
    },
    {
        "title": [
            "Has depression NERF'd your memory?"
        ],
        "text": [
            "Went through a period where I ate hardly nothing for 3 weeks",
            "due to severe depression. 6 months later (and still",
            "depressed) it feels like my memory is made of Swiss cheese.",
            "I've heard of depression causing pseudodementia. Will this",
            "get better with treatment or are these cognitive issues for",
            "life?  Has anyone else's memory became a giant sieve since",
            "they got depressed?"
        ]
    },
    {
        "title": [
            "I want a hug"
        ],
        "text": [
            "I feel really pathetic for coming to reddit for this haha.",
            "can somebody just tell me it will be okay? please? I need to",
            "hear it right now."
        ]
    },
    {
        "title": [
            "Give me reason why I shouldn’t end my life"
        ],
        "text": [
            "22 year old female I’ve given up…"
        ]
    },
    {
        "title": [
            "Wellness Wednesday"
        ],
        "text": [
            ">*“Sometimes the bravest and most important thing you can do",
            "is just show up.” - Brené Brown*  Midweek is a good time to",
            "check in.   This thread is open to whatever’s on your mind.",
            "What’s been going well?   What’s been frustrating?   What’s",
            "something you’re trying to handle?   What’s helped you get",
            "through the week so far?  You don’t need to explain",
            "everything.   You don’t need to have a big insight.  Just",
            "show up. Say what you want.   We’re listening.  **How are",
            "you doing, really?**"
        ]
    },
    {
        "title": [
            "r/MentalHealth is looking for moderators"
        ],
        "text": [
            "Hey r/mentalhealth! We're looking to grow our moderation",
            "team. Moderators are a key part of what makes any reddit",
            "community special. If you are interested in helping to make",
            "this community special, we'd like to talk to you.  # What do",
            "the mods do?  Moderators here on mentalhealth work to build",
            "our community and make this a safe place to discuss the many",
            "facets of mental health and the ways that mental health and",
            "mental wellness influence daily life. Moderators help to",
            "write the rules, respond to content concerns, set policies,",
            "update community themes and appearance, manage automation,",
            "and general upkeep.  # What are the minimum requirements to",
            "apply? Can I apply if I've never been a moderator before?",
            "If you care about mental health and would like to be a part",
            "of our amazing team of moderators, then we'd like to hear",
            "from you. Prior experience is a plus, but not the most",
            "important thing we're looking for. We want moderators who",
            "care about mental health and the r/mentalhealth community,",
            "fit well with our team, and want to help.  If this describes",
            "you there are some steps below that we'd like you to take to",
            "apply. These steps include some open ended questions that",
            "we'd like your thoughtful answers on. Everything else that",
            "you might need to know we can help you learn along the way.",
            "If you're interested in moderating and want to get a head",
            "start on all there is to know, we recommend you [check out",
            "the reddit training offered",
            "here.](https://redditforcommunity.com)  # What are the",
            "expectations for moderators who join the r/mentalhealth mod",
            "team?  Mod team members need to be a part of the team. We",
            "need people who will engage and communicate about what they",
            "see and what questions they have. Our mod team is supportive",
            "and understanding. We know you have a life outside of",
            "reddit, and we expect you to put that life first. Sometimes",
            "that means you might have less time to moderate and that's",
            "okay. We expect communication and coordination so that we",
            "can support each other and bring in more help when we need",
            "to.  # Is there anything I should know about moderating",
            "r/mentalhealth before I apply?  Yes. r/mentalhealth is a",
            "support community for mental health and we often encounter",
            "posts and comments that describe traumatic experiences or",
            "crisis. Some of this content can be disturbing.  Our team",
            "policy is that when a post or comment is too much for one of",
            "us to handle, we let the rest of the team know and someone",
            "else will step in to handle it, *but there is no way to",
            "eliminate the exposure completely*.  If you apply, please",
            "expect that we will ask you about your comfort level in",
            "moderating content of this nature and what strategies you",
            "might use to make sure your own mental health needs are met.",
            "No one is expected to address issues that are uncomfortable",
            "for them, but you should expect to encounter such things if",
            "you join the team.  Second, we require that moderators join",
            "our discord server, where we communicate and coordinate our",
            "moderation efforts. Part of the application process includes",
            "joining us on that server for a chat. You will need a",
            "discord account (can be an existing account if you have",
            "one).  # How do I apply?  If you are interested in joining",
            "our team, here is the process we follow:  1. Send us a",
            "modmail indicating that you are interested and include",
            "answers to the following questions:    * What does mental",
            "health mean to you?    * Why are you interested in being a",
            "moderator on r/mentalhealth?    * In your opinion, what are",
            "some differences between a good moderator and a bad",
            "moderator? 2. We will review your modmail and your",
            "application. We may ask for some additional information",
            "about your moderation experience and how familiar you are",
            "with reddit. We may use a google form to structure those",
            "questions. 3. We will invite candidates we think might be a",
            "good fit to join us on our discord server so we can interact",
            "and get to know each other before making a decision on",
            "extending an invitation to be a moderator. 4. New moderators",
            "on the r/mentalhealth moderator team start out with a trial",
            "run that will last about four weeks. During that time, the",
            "trial moderator will have limited moderation",
            "responsibilities, both for evaluation and to help provide a",
            "structured way to get up to speed.  Thanks for reading, and",
            "we hope you apply!"
        ]
    },
    {
        "title": [
            "I'm so disgusted by the human body that it's affecting my",
            "mental health"
        ],
        "text": [
            "I get disphororia from being a human. This flesh body is",
            "disgusting. I hate needing to shit and piss and fart and",
            "sweat and get old and have my period all the other gross",
            "stuff human bodies do. I've lost sleep thinking about how",
            "disgusted I am by basic biology. I'm sorry, I'm not supposed",
            "to be ashamed of smelly things coming out of me because it",
            "happens to everyone??? No. Still grossed out. Everytime I",
            "see an attractive person I imagine how gross they probably",
            "are when no one's looking and instantly lose all attraction.",
            "How they probably burp as loud as they can and fart in bed",
            "or scratch their ass and smell it. I'm probably never going",
            "to date anyone because of it.   I hate being human."
        ]
    },
    {
        "title": [
            "I need a reason to stay alive"
        ],
        "text": [
            "I can't take it anymore and I'm just ready to go. I don't",
            "have to courage to actually go because I don't know what",
            "happens after death. I'm on medication right now and I just",
            "started taking it, but I don't think medication is going to",
            "help. My mind keeps racing and I can't focus because of",
            "trauma. I wish I could go back in time and start all over",
            "again with the same memories that I have now.   The",
            "flashbacks are also bothering me because it's not like it's",
            "just mental and emotional, but I feel like I'm physically",
            "being teleported back into the trauma. I have anxiety and",
            "paranoia and I've been trying to get help, but I'm just",
            "ready to give up. I told myself that I wanted 2025 to be my",
            "last year and I might stick to that if things don't turn",
            "around for me. There is nothing for me in life and there",
            "never was."
        ]
    },
    {
        "title": [
            "Ahahhahahahahaahahhahahahahahahaahaahahsahhaahahahahhahahahahahahahahahahahahahahahhahahahaha"
        ],
        "text": [
            "Im so scared of myself why is my skin so itchy"
        ]
    },
    {
        "title": [
            "r/Anxiety is looking for new moderators"
        ],
        "text": [
            "Hello friends!  We're looking to grow the moderation team",
            "here at [r/Anxiety](https://www.reddit.com/r/Anxiety/).",
            "Moderators are a key part of what makes any Reddit community",
            "special. If you are interested in helping to make this",
            "community special, we'd like to talk to you.  # What does a",
            "moderator do?  Moderators here",
            "at [r/Anxiety](https://www.reddit.com/r/Anxiety/) work to",
            "build our community and make this a safe place to discuss",
            "the many facets of anxiety and the ways that anxiety and",
            "mental wellness influence daily life. Moderators help to",
            "write the rules, respond to content concerns, set policies,",
            "update community themes and appearance, manage automation,",
            "and general upkeep.  # What are the minimum requirements to",
            "apply?  If you care about mental health and would like to be",
            "a part of our amazing team of moderators, then we'd like to",
            "hear from you. Prior experience is a plus, but not the most",
            "important thing we're looking for. We want moderators who",
            "care about the topic of anxiety and the r/Anxiety community,",
            "fit well with our team, and want to help.  If this describes",
            "you, there are some steps below that we'd like you to take",
            "to apply. These steps include some open-ended questions that",
            "we'd like your thoughtful answers on. Everything else that",
            "you might need to know, we can help you learn along the way.",
            "If you're interested in moderating and want to get a head",
            "start on all there is to know, we recommend you [check out",
            "the Reddit training offered",
            "here.](https://redditforcommunity.com/)  # What are the",
            "expectations for users who join the r/Anxiety moderation",
            "team?  We need people who will engage and communicate about",
            "what they see and what questions they have. Our moderation",
            "team is supportive and understanding. We know you have a",
            "life outside of Reddit, and we expect you to put that life",
            "first. Sometimes that means you might have less time to",
            "moderate and that's okay. We expect communication and",
            "coordination so that we can support each other and bring in",
            "more help when we need to.  # Anything I should know before",
            "I apply?",
            "Yes, [r/Anxiety](https://www.reddit.com/r/Anxiety/) is a",
            "support community for anxiety and other related illnesses",
            "and we often encounter posts and comments that describe",
            "traumatic experiences or crisis. Some of this content can be",
            "disturbing.  Our team policy is that when a post or comment",
            "is too much for one of us to handle, we let the rest of the",
            "team know and someone else will step in to handle it, *but",
            "there is no way to eliminate the exposure completely*.  If",
            "you apply, please expect that we will ask you about your",
            "comfort level in moderating content of this nature and what",
            "strategies you might use to make sure your own mental health",
            "needs are met.  No one is expected to address issues that",
            "are uncomfortable for them, but you should expect to",
            "encounter such things if you join the team.  Second, we",
            "require that moderators join our Discord server, where we",
            "communicate and coordinate our moderation efforts. Part of",
            "the application process includes joining us on that server",
            "for a chat. You will need a Discord account (can be an",
            "existing account if you have one).  # How do I apply?  If",
            "you are interested in joining our team, here is the process",
            "we follow:  1. Send us",
            "a [modmail](https://www.reddit.com/message/compose?to=r/anxiety) indicating",
            "that you are interested and include answers to the following",
            "questions:    * What does mental health mean to you?    *",
            "Why are you interested in being a moderator on r/Anxiety ?",
            "* In your opinion, what are some differences between a good",
            "moderator and a bad moderator? 2. We will review",
            "your [modmail](https://www.reddit.com/message/compose?to=r/anxiety) and",
            "your application. If we find your answers satisfactory, we",
            "will send a form for you to fill out. 3. We will invite",
            "candidates we think might be a good fit to join us on our",
            "Discord server so we can interact and get to know each other",
            "before making a decision on extending an invitation to be a",
            "moderator. 4. New moderators on the r/Anxiety moderator team",
            "start out with a trial run that will last about three weeks.",
            "During that time, the trial moderator will have limited",
            "moderation responsibilities, both for evaluation and to help",
            "provide a structured way to get up to speed.  Thanks for",
            "reading, and we hope you apply!"
        ]
    },
    {
        "title": [
            "Monthly Check-In Thread"
        ],
        "text": [
            "Hello everyone! Welcome to the r/Anxiety monthly check-in",
            "thread. We want this to serve as casual community chat for",
            "anyone who wants to get or stay involved without having to",
            "make a full post. Plus you can use this as an easy way to",
            "give us feedback on what you like and don't like about the",
            "subreddit.  Our mod team also maintains an official mental",
            "health Discord server for people who prefer realtime",
            "community, venting, peer support and off topic chat. We hope",
            "to see you there! Join link:",
            "[https://discord.com/invite/9sSCSe9](https://discord.com/invite/9sSCSe9)",
            "# Checking In  Let us know what's on your mind! This",
            "includes (but is not limited to) any significant life",
            "changes/events that have happened recently; an improvement",
            "or decrease in your mental health; any upcoming plans that",
            "you're looking forward to (or dreading); issues you're",
            "dealing with in your own local or extended community;",
            "general sources of stress or frustration in your daily life;",
            "words of advice or comfort you want to share with everyone;",
            "questions/comments/concerns you want to share with the",
            "moderators and community regarding the subreddit.  Thanks",
            "and stay safe,  The r/Anxiety Mod Team"
        ]
    },
    {
        "title": [
            "How do you know if you are having anxiety or a panic attack?"
        ],
        "text": [
            "There are times I know for sure if I am having a panic",
            "attack or if I'm just anxious. Sometimes I can't tell if I",
            "am just doing well at managing my panic attack or if my",
            "anxiety is really high but not quite reaching levels of",
            "panic. Is there a set definition or any way to know?  I",
            "don't really agree with the definition that panic attacks",
            "are sudden and unexpected and I also believe there are",
            "different levels of panic attacks."
        ]
    },
    {
        "title": [
            "Anxiety without thoughts"
        ],
        "text": [
            "Hi everyone, I’m wondering if anyone here has a similar",
            "experience to mine. I often wake up with intense anxiety, or",
            "it hits me at random points during the day — but there’s no",
            "specific thought triggering it. It’s just a strong physical",
            "feeling of anguish or unease, often centered in my chest. I",
            "try to analyze it, to find what’s behind it, but I come up",
            "with nothing. My mind is blank — no negative inner dialogue,",
            "no catastrophizing — just the feeling itself.  This makes",
            "traditional CBT (Cognitive Behavioral Therapy) quite",
            "difficult for me. Most therapists I’ve seen rely heavily on",
            "CBT, but since I can’t identify any conscious thoughts, I",
            "feel like I don’t fit the model. I’m not trying to discredit",
            "CBT — I know it helps a lot of people — but in my case, it",
            "doesn’t seem to reach the core of the issue.  So my question",
            "is: has anyone else dealt with this kind of thoughtless",
            "anxiety? How did you approach it? Did you find a type of",
            "therapy or practice that actually helped?  Thanks for",
            "reading. I’d appreciate any insights or shared experiences"
        ]
    },
    {
        "title": [
            "Generalized anxiety disorder. Any tips please?"
        ],
        "text": [
            "I have really bad generalized anxiety disorder   I worry all",
            "the time. It gets worse when I have work stress. It’s a",
            "holiday here in Canada and I can’t even enjoy because I’m",
            "worried about something work related.   it’s impacting my",
            "daily life in a debilitating way. Impacting my marriage,",
            "impacting being present with my kids and I truly feel like I",
            "don’t remember the last time I felt relaxed   I can’t handle",
            "crowds. I fear failure. I fear criticism. I break down over",
            "the smallest mistakes I make. I have no idea what’s wrong",
            "with me.   I download a meditation app and I booked a",
            "psychology session. Hoping this helps   anything else that",
            "has helped you? wondering if I need to start meds   Thank",
            "you so much. I’m 35 and I just want to feel like I’m living",
            "somewhat of a normal life."
        ]
    }
]